{"sections":{"166161901464a25e50":{"type":"image-with-text-overlay","blocks":{"166161901437c6bc67-1":{"type":"heading","settings":{"text":"<h1>OUR STORY<\/h1>","heading_size":"h1-xlarge"}},"166161901437c6bc67-2":{"type":"text","settings":{"text":"<p>Thrive Workwear is deeply-rooted in research and innovation, crafting products that solve real-life problems in the field with the highest standards of quality in manufacturing.<\/p><p>Our Mission:<\/p><p>Through invention and technology, we create unique workwear products, to help make the workplace a safer place and workers become more productive, efficient and comfortable.<\/p><p>Since 2007, Thrive Workwear’s Founders came from industry trades and recognized a real need for innovation in work apparel. <\/p><p>Simply put, standard workwear was just clothing with a fancy brand tag and really did not solve worker safety issues.  Our patented SQUISH® Pad Technology revolutionized the way workers protected their knees and solved the negative issues companies were experiencing with their safety initiatives as it related to knee protection.  Having a full-time knee pad installed directly into work pants eliminated the humans-factor of worker’s wanting to wear knee pads.  Our goal is to continue developing our market so that knee pad work pants becomes a standard in workers daily lives across all industries.<\/p><p>For more information about our company, please contact us at <a href=\"mailto:info@thriveworkwear.com\">info@thriveworkwear.com<\/a><\/p>","description_size":"small"}}},"block_order":["166161901437c6bc67-1","166161901437c6bc67-2"],"settings":{"section_width":"full-width-row-full","image":"shopify:\/\/shop_images\/homepageshotONE-1.jpg","image_parallax":false,"desktop_height":"desktop-height-550","mobile_height":"mobile-height-500","content_width":"medium","content_position":"middle-center","text_alignment":"center","overlay_opacity":20,"disable_top_spacing":true,"disable_bottom_spacing":false}}},"order":["166161901464a25e50"]}